<html>
<body>
 <h1>Einstellungen</h1>
  Die Einstellungen nehmen Sie in einem separaten Fenster vor,
  dass Sie &uuml;ber das Men&uuml; <em>Extra</em> des Hauptfensters
  aufrufen.
  Die weiteren Ausf&uuml;hrungen beziehen sich auf dieses Fenster.
 <br/><br/>
  <ul>
   <li>
    <a href="settings.htm#groups">1. Gruppierung der einzelnen Einstellungen</a>
    <ul>
     <li><a href="settings.htm#system">1.1. System</a>
      <ul>
       <li>
        <a href="settings.htm#reg_count">1.1.1. Register %80 bis %EF emulieren</a>
       </li>
      </ul>
     </li>
     <li><a href="settings.htm#ram">1.2. RAM</a></li>
     <li><a href="settings.htm#rom">1.3. ROM</a></li>
     <li><a href="settings.htm#confirm">1.4. Best&auml;tigungen</a></li>
     <li><a href="settings.htm#laf">1.5. Erscheinungsbild</a></li>
     <li><a href="settings.htm#ui_scale">1.6. Fensterskalierung</a></li>
     <li><a href="settings.htm#etc">1.7 Sonstiges</a>
      <ul>
       <li><a href="settings.htm#filedlg">1.7.1. Dateiauswahldialog</a></li>
       <li>
        <a href="settings.htm#margin">1.7.2. Rand um Bildschirmausgabe</a>
       </li>
       <li>
        <a href="settings.htm#refresh">1.7.3. Aktualisierungszyklus der Bildschirmausgabe</a>
       </li>
       <li>
        <a href="settings.htm#paths">1.7.4. Zuletzt verwendete Dateipfade werden gespeichert in Datei</a>
       </li>
       <li>
        <a href="settings.htm#save">1.7.5. Einstellungen werden gespeichert in Datei</a>
       </li>
      </ul>
     </li>
     <li>
      <a href="settings.htm#apply">2. Einstellungen &uuml;bernehmen und speichern</a>
     </li>
    </ul>
   </li>
  </ul>
 <br/>

 <h2><a name="groups">1. Gruppierung der einzelnen Einstellungen</a></h2>
  Die einzelnen Einstellm&ouml;glichkeiten sind thematisch gruppiert.
  Jede einzelne Gruppe finden Sie auf einer separaten Unterseite,
  die Sie &uuml;ber die Reiter am oberen Rand erreichen.
 <br/><br/>

 <h3><a name="system">1.1. System</a></h3>
  Den JU+TE-Computer gibt es in mehreren Ausbaustufen,
  die sich sowhl von der Gr&ouml;&szlig;e des Betriebssystems
  als auch von der Hardware unterscheiden.
  Mit den Einstellungen in der Gruppe <em>System</em> w&auml;hlen
  sie die gew&uuml;nschte Ausbaustufe aus.
 <br/><br/>

 <h3><a name="reg_count">1.1.1. Register %80 bis %EF emulieren</a></h3>
  Der Einchipmikrorechner U883 enth&auml;lt 124 Universalregister
  (Register %04 bis %7F).
  Neuere Z8-Mikrocontroller beherbergen dagegen sogar
  236&nbsp;Universalregister, d.h. auch die Register %80 bis %EF.
  Mit der Option geben Sie an,
  ob auch diese zus&auml;tzlichen Register emuliert werden sollen.
 <br/><br/>

 <h3><a name="ram">1.2. RAM</a></h3>
  Hier legen Sie den RAM-Bereich fest
  (siehe <a href="../common/jtc.htm#memory">Speicheraufteilung</a>).
 <br/><br/>
  <b>Achtung!</b> Bei <em>1&nbsp;KByte RAM</em> und <em>2&nbsp;KByte RAM</em>
  wird wie beim Original die unvollst&auml;ndige Adressdekodierung emuliert,
  d.h., der 1-KByte-Speicher ist ab Adresse %E000 8&nbsp;mal beziehungsweise
  der 2-KByte-Speicher 4 mal hintereinander eingeblendet.
 <br/><br/>

 <h3><a name="rom">1.3. ROM</a></h3>
  Mit der Auswahl des Betriebssystems in den Einstellungen bei
  <em>System</em> sind auch die ROM-Bereiche vorgegeben.
  Zus&auml;tzlich k&ouml;nnen Sie diese ROM-Bereiche
  &uuml;berschreiben bzw. neue ROM-Bereiche anlegen,
  indem Sie externe ROM-Images einbinden.
  Diese ROM-Images m&uuml;ssen als
  <a href="../common/loadsave.htm#binary">Bin&auml;rdateien</a> vorliegen.
 <br/><br/>
  Ein ROM-Image binden Sie ein, indem Sie auf den Knopf
  <em>Hinzuf&uuml;gen</em> dr&uuml;cken.
  In dem sich nun &ouml;ffnenden Dateiauswahldialog selektieren Sie
  die einzubindende Bin&auml;rdatei.
  Anschlie&szlig;end werden Sie nach der Anfangsadresse gefragt,
  an der das ROM-Image im Arbeitsspeicher zu finden sein soll.
  Die L&auml;nge des so angelegten ROM-Bereichs ergibt sich aus der
  L&auml;nge der eingebundenen Datei.
 <br/><br/>
  ROM-Images k&ouml;nnen an jeder beliebigen Adresse eingebunden werden,
  egal ob das sinnvoll ist oder nicht.
  Sie k&ouml;nnen somit auch den Bildwiederholspeicher
  oder den Stack-Bereich als ROM deklarieren,
  was h&ouml;chstwahrscheinlich nicht sinnvoll ist.
  Wenn Sie ein ROM-Image auf Adresse %0000 einbinden,
  wird damit der BASIC-Interpreter des U883 &uuml;berschrieben,
  was bei einem echten JU+TE-Computer nicht m&ouml;glich ist.
 <br/><br/>
  Als weitere Option k&ouml;nnen Sie festlegen,
  ob die ROM-Dateien bei jedem simulierten <em>Einschalten</em>
  neu geladen werden sollen.
  Im Normalfall hat das wenig Sinn.
  Doch wenn Sie ein Betriebssystem f&uuml;r den JU+TE-Computer entwickeln
  und den Emulator zum Testen verwenden,
  ist diese Option sehr hilfreich.
  Nachdem Sie mit Ihren Entwicklungswerkzeugen ein neues ROM-Image
  erzeugt haben, brauchen Sie im Emulator nur das
  <em>Einschalten (Speicher l&ouml;schen)</em> ausl&ouml;sen,
  und schon ist die neue Betriebssystemversion aktiv.
 <br/><br/>

 <h3><a name="confirm">1.4. Best&auml;tigungen</a></h3>
  Hier geben Sie an, welche Aktionen erst nach der Bejahung einer
  Sicherheitsabfrage ausgef&uuml;hrt werden sollen.
 <br/><br/>

 <h3><a name="laf">1.5. Erscheinungsbild</a></h3>
  JTCEMU wurden mit der Programmiersprache Java
  entwickelt, der ein plattform&uuml;bergreifendes Konzept zu Grunde liegt.
  Manche Leute w&uuml;nschen sich,
  dass eine Applikation unter jedem Betriebssystem gleich aussieht,
  andere wiederum bevorzugen es, dass sich eine Applikation
  an das Aussehen der jeweiligen Plattform anpasst.
  Die bei JTCEMU verwendete Oberfl&auml;chentechnologie AWT/Swing
  wird diesen unterschiedlichen Anspr&uuml;chen gerecht,
  indem es sich in verschiedenen Erscheinungsbildern pr&auml;sentieren kann.
  JTCEMU bietet deshalb diese M&ouml;glichkeit auch an.
 <br/><br/>
  Welche Erscheinungsbilder auf welcher Plattform unterst&uuml;tzt werden,
  h&auml;ngt von der jeweiligen Java-Version ab.
  In der Regel sind das aber mindestens das plattform&uuml;bergreifende
  Erscheinungsbild <em>Metal</em> und ein dem lokalen Betriebssystem
  angepasstes Erscheinungsbild.
 <br/><br/>
  Die Erscheinungsbilder haben nicht nur Auswirkungen auf das Aussehen
  der Fenster, sondern auch auf die Funktionsweise der Dateiauswahlbox,
  sofern Sie den JTCEMU-eigenen Dateiauswahldialog eingestellt haben.
 <br/><br/>
  Steht nur ein einziges Erscheinungsbild zur Verf&uuml;gung,
  d.h. wenn keine Auswahl m&ouml;glich ist,
  wird das Unterfenster <em>Erscheinungsbild</em> in den Einstellungen
  erst gar nicht angeboten.
 <br/><br/>

 <h3><a name="ui_scale">1.6. Fensterskalierung</a></h3>
  Auf hochaufl&ouml;senden Bildschirmen sehen die Fenster
  mitunter ziemlich klein aus.
  JTCEMU bietet deshalb die M&ouml;glichkeit,
  die Fenster gr&ouml;&szlig;er skalieren zu lassen.
  Die Skalierung basiert auf einer Eigenschaft,
  die mit Java&nbsp;9 eingef&uuml;hrt wurde.
  Aus diesem Grund wird f&uuml;r die Skalierung eine Java-Laufzeitumgebung
  in der Version&nbsp;9 oder eine h&ouml;here Version ben&ouml;tigt.
 <br/><br/>
  Standardm&auml;&szlig;ig skaliert Java ab Version&nbsp;9
  die Fenster automatisch auf hochaufl&ouml;senden Bildschirmen.
  JTCEMU bietet jedoch die M&ouml;glichkeit,
  dieses Standardverhalten zu ver&auml;ndern.
  So kann man die Skalierung ausschalten,
  das Java-Standardverhalten belassen
  oder eine feste Skalierung einstellen.
  Bei der festen Skalierung gibt man in das entsprechende Eingabefeld
  einen beliebigen Prozentwert ein und dr&uuml;ckt <em>Enter</em>.
  Auf manchen Betriebssystemen werden allerdings nur Skalierungen
  in 100%-Schritten unterst&uuml;tzt.
 <br/><br/>

 <h3><a name="etc">1.7 Sonstiges</a></h3>
  In dieser Gruppe finden Sie die Einstellungen,
  die sich in keine andere Gruppe sinnvoll einordnen lassen.
 <br/><br/>

 <h3><a name="filedlg">1.7.1. Dateiauswahldialog</a></h3>
  JTCEMU kommt mit einem eigenen Dateiauswahldialog daher.
  Dieser hat den Vorteil,
  dass er auf die Bed&uuml;rfnisse des Emulators zugeschnitten ist.
  So wird z.B. beim Anklicken einer Datei diese analysiert und,
  sofern es sich um einen von JTCEMU unterst&uuml;tzten Dateityp handelt,
  die relevanten Informationen in der Statuszeile angezeigt.
  Au&szlig;erdem passt er sich auch optisch und funktional
  dem eingestellten Erscheinungsbild an.
 <br/><br/>
  M&ouml;glicherweise ist aber der JTCEMU-Dateiauswahldialog
  nicht so gut auf die spezifischen Eigenheiten des Systems angepasst
  wie die standardm&auml;&szlig;ige Dateiauswahlbox des Betriebssystems.
  Aus diesem Grund haben Sie hier die M&ouml;glichkeit,
  zwischen beiden Dateiauswahldialogen zu w&auml;hlen.
 <br/><br/>

 <h3><a name="margin">1.7.2. Rand um Bildschirmausgabe</a></h3>
  Sie k&ouml;nnen einen schwarzen Rand um die Bildschrirmausgabe erzeugen,
  indem Sie das Hauptfenster gr&ouml;&szlig;er ziehen.
  Wenn Sie nun jedoch eine andere Skalierung der Bildschirmausgabe
  w&auml;hlen oder in den Einstellungen ein Betriebssystem mit einer
  anderen Grafikaufl&ouml;sung oder ein anderes Erscheinungsbild aktivieren,
  passt der Emulator das Hauptfenster an die neuen Erfordernisse an,
  womit der Rand wieder verschwindet.
  Mit dieser Option k&ouml;nnen Sie einen Rand festlegen,
  der in solchen F&auml;llen zur Geltung kommt.
 <br/><br/>

 <h3>
  <a name="refresh">1.7.3. Aktualisierungszyklus der Bildschirmausgabe</a>
 </h3>
  Der Emulator aktualisiert zyklisch die Bildschirmausgabe
  entsprechend den &Auml;nderungen im Bildwiederholspeicher
  bzw. im Video-RAM.
  Eine k&uuml;rzere Zykluszeit bewirkt eine fl&uuml;ssigere
  Bildschirmausgabe.
  Allerdings steigt damit auch der Bedarf an Rechenleistung.
  Eine zu kurze Zykluszeit kann die Bedienung des Emulators
  beeintr&auml;chtigen, da dann evtl. zu wenig Rechenleistung f&uuml;r
  das Reagieren auf die Benutzeraktionen zur Verf&uuml;gung steht.
 <br/><br/>
  Der Standardwert von 50 ms, d.h. 20 mal pro Sekunde,
  ist in der Regel auf den heute &uuml;blichen Arbeitsplatzrechnern
  ein guter Kompromiss zwischen fl&uuml;ssiger Bildschirmausgabe und
  fl&uuml;ssiger Bedienung.
 <br/><br/>

 <h3>
  <a name="paths">1.7.4. Zuletzt verwendete Dateipfade werden gespeichert in Datei</a>
 </h3>
  Die hier angegebene Datei ist das Ged&auml;chtnis des Emulators
  f&uuml;r die zuletzt verwendeten Dateipfade.
  Damit wird erm&ouml;glicht, dass beim &Ouml;ffnen, Laden oder Speichern
  einer Datei der Dateiauswahldialog gleich mit dem Verzeichnis &ouml;ffnet,
  welches zuletzt f&uuml;r die betreffende Dateikategorie verwendet wurde.
 <br/><br/>
  Sie k&ouml;nnen diese Ged&auml;chtnisdatei beliebig l&ouml;schen
  (sofern sie bereits exisitiert).
  Dann &ouml;ffnet beim n&auml;chsten mal der Dateiauswahldialog
  in einem Standardverzeichnis.
  Beim n&auml;chsten erfolgreichen &Ouml;ffnen, Laden oder Speichern
  einer Datei wird diese Ged&auml;chtnisdatei automatisch wieder angelegt.
 <br/><br/>

 <h3><a name="save">1.7.5. Einstellungen werden gespeichert in Datei</a></h3>
  Hier sehen Sie den vollst&auml;ndigen Namen der Datei,
  in dem die Einstellungen gespeichert werden (siehe weiter unten).
 <br/><br/>
  Sie haben die M&ouml;glichkeit,
  diese Datei zu l&ouml;schen, sofern sie bereits existiert.
  Damit k&ouml;nnen Sie auf die Standardeinstellungen zur&uuml;cksetzen.
  Starten Sie dazu nach dem L&ouml;schen der Datei den Emulator einfach neu.
 <br/><br/>

 <h2><a name="apply">2. Einstellungen &uuml;bernehmen und speichern</a></h2>
  Nachdem Sie eine Einstellung ge&auml;ndert haben,
  wird der Knopf <em>&Uuml;bernehmen</em> aktiv,
  und sie k&ouml;nnen damit die neuen Einstellungen aktivieren.
 <br/><br/>
  Nach dem Aktivieren der neuen Einstellungen wird der Knopf
  <em>Speichern</em> aktiv.
  Damit haben Sie die M&ouml;glichkeit,
  die Einstellungen dauerhaft zu speichern,
  damit sie beim n&auml;chsten Start des Emulators
  wieder so gesetzt werden.
 <br/><br/>
  Beim Speichern der Einstellungen werden auch die Positionen
  der aktuell ge&ouml;ffneten JTCEMU-Fenster gespeichert.
</body>
</html>
