<html>
<body>
<h1>Deutsche &Uuml;bersetzung der GNU-GPL Version 3, 29. Juni 2007</h1>
  Den offiziellen englischen Originaltext finden Sie unter:
  http://www.gnu.org/licenses/gpl.html
<br/><br/>
  Deutsche &Uuml;bersetzung: Peter Gerwinski (http://www.peter.gerwinski.de),
  5.7.2007
<br/><br/>
  Dies ist eine inoffizielle deutsche &Uuml;bersetzung der GNU General
  Public License, die nicht von der Free Software Foundation
  herausgegeben wurde. Es handelt sich hierbei <em>nicht</em> um
  eine rechtsg&uuml;ltige Festlegung der Bedingungen f&uuml;r die Weitergabe
  von Software, die der GNU GPL unterliegt; dies leistet nur der
  englische Originaltext. Wir hoffen jedoch, da&szlig; diese &Uuml;bersetzung
  deutschsprachigen Lesern helfen wird, die GNU GPL besser zu
  verstehen.
<br/><br/>
  <em>
    This is an unofficial translation of the GNU General Public
    License into German. It was not published by the Free Software
    Foundation, and does not legally state the distribution terms for
    software that uses the GNU GPL&mdash;only the original English
    text of the GNU GPL does that. However, we hope that this
    translation will help German speakers understand the GNU GPL
    better.
  </em>
<br/><br/>

<h1 align="center">GNU General Public License</h1>
<p align="center">
  Deutsche &Uuml;bersetzung der Version 3, 29. Juni 2007
</p>
<p align="center">
  Copyright &copy; 2007 Free Software Foundation, Inc. (http://fsf.org/)
  51 Franklin Street, Fifth Floor, Boston, MA 02110-1301, USA
</p>
  Es ist jedermann gestattet, diese Lizenzurkunde zu vervielf&auml;ltigen
  und unver&auml;nderte Kopien zu verbreiten; &Auml;nderungen sind jedoch
  nicht erlaubt.
<br/><br/>
  Diese &Uuml;bersetzung ist kein rechtskr&auml;ftiger Ersatz f&uuml;r die
  englischsprachige Originalversion!
<br/><br/>

<h2>Vorwort</h2>
  Die GNU General Public License &ndash; die Allgemeine &Ouml;ffentliche
  GNU-Lizenz &ndash; ist eine freie Copyleft-Lizenz f&uuml;r Software und
  andere Arten von Werken.
<br/><br/>
  Die meisten Lizenzen f&uuml;r Software und andere nutzbaren Werke sind
  daraufhin entworfen worden, Ihnen die Freiheit zu nehmen, die
  Werke mit anderen zu teilen und zu ver&auml;ndern. Im Gegensatz dazu
  soll Ihnen die <em>GNU General Public License</em> die Freiheit
  garantieren, alle Versionen eines Programms zu teilen und zu
  ver&auml;ndern. Sie soll sicherstellen,
  da&szlig; die Software f&uuml;r alle ihre
  Benutzer frei bleibt. Wir, die Free Software Foundation, nutzen
  die GNU General Public License f&uuml;r den gr&ouml;&szlig;ten Teil unserer
  Software; sie gilt au&szlig;erdem f&uuml;r jedes andere Werk, dessen Autoren
  es auf diese Weise freigegeben haben. Auch Sie k&ouml;nnen diese Lizenz
  auf Ihre Programme anwenden.
<br/><br/>
  Wenn wir von freier Software sprechen, so beziehen wir uns auf
  Freiheit, nicht auf den Preis. Unsere Allgemeinen &Ouml;ffentlichen
  Lizenzen sind darauf angelegt, sicherzustellen, da&szlig; Sie die
  Freiheit haben, Kopien freier Software zu verbreiten (und daf&uuml;r
  etwas zu berechnen, wenn Sie m&ouml;chten), die M&ouml;glichkeit,
  da&szlig; Sie die Software als Quelltext erhalten oder den Quelltext
  auf Wunsch bekommen, da&szlig; Sie die Software &auml;ndern
  oder Teile davon in neuen freien Programmen verwenden d&uuml;rfen
  und da&szlig; Sie wissen, da&szlig; Sie dies alles tun d&uuml;rfen.
<br/><br/>
  Um Ihre Rechte zu sch&uuml;tzen, m&uuml;ssen wir andere daran hindern, Ihnen
  diese Rechte zu verweigern oder Sie aufzufordern, auf diese Rechte
  zu verzichten. Aus diesem Grunde tragen Sie eine Verantwortung,
  wenn Sie Kopien der Software verbreiten oder die Software
  ver&auml;ndern: die Verantwortung, die Freiheit anderer zu
  respektieren.
<br/><br/>
  Wenn Sie beispielsweise die Kopien eines solchen Programms
  verbreiten &ndash; kostenlos oder gegen Bezahlung &ndash; m&uuml;ssen
  Sie an die Empf&auml;nger dieselben Freiheiten weitergeben, die Sie
  selbst erhalten haben. Sie m&uuml;ssen sicherstellen, da&szlig; auch die
  Empf&auml;nger die Software im Quelltext erhalten bzw.&nbsp;den
  Quelltext erhalten k&ouml;nnen. Und Sie m&uuml;ssen ihnen diese Bedingungen
  zeigen, damit sie ihre Rechte kennen.
<br/><br/>
  Software-Entwickler, die die GNU GPL nutzen, sch&uuml;tzen Ihre Rechte
  in zwei Schritten: (1) Sie machen ihr Urheberrecht (Copyright) auf
  die Software geltend, und (2) sie bieten Ihnen diese Lizenz an,
  die Ihnen das Recht gibt, die Software zu vervielf&auml;ltigen, zu
  verbreiten und/oder zu ver&auml;ndern.
<br/><br/>
  Um die Entwickler und Autoren zu sch&uuml;tzen, stellt die GPL
  dar&uuml;berhinaus klar, da&szlig; f&uuml;r diese freie Software keinerlei
  Garantie besteht. Um sowohl der Anwender als auch der Autoren
  Willen erfordert die GPL, da&szlig; modifizierte Versionen der Software
  als solche gekennzeichnet werden, damit Probleme mit der
  modifizierten Software nicht f&auml;lschlicherweise mit den Autoren der
  Originalversion in Verbindung gebracht werden.
<br/><br/>
  Manche Ger&auml;te sind daraufhin entworfen worden, ihren Anwendern zu
  verweigern, modifizierte Versionen der darauf laufenden Software
  zu installieren oder laufen zu lassen, wohingegen der Hersteller
  diese M&ouml;glichkeit hat. Dies ist grunds&auml;tzlich unvereinbar mit dem
  Ziel, die Freiheit der Anwender zu sch&uuml;tzen, die Software zu
  modifizieren. Derartige gezielte mi&szlig;br&auml;uchliche Verhaltensmuster
  finden auf dem Gebiet pers&ouml;nlicher Gebrauchsgegenst&auml;nde statt
  &ndash; also genau dort, wo sie am wenigsten akzeptabel sind. Aus
  diesem Grunde wurde diese Version der GPL daraufhin entworfen,
  diese Praxis f&uuml;r diese Produkte zu verbieten. Sollten derartige
  Probleme substantiell auf anderen Gebieten auftauchen, sind wir
  bereit, diese Regelung auf diese Gebiete auszudehnen, soweit dies
  notwendig ist, um die Freiheit der Benutzer zu sch&uuml;tzen.
<br/><br/>
  Schlie&szlig;lich und endlich ist jedes Computerprogramm permanent durch
  Software-Patente bedroht. Staaten sollten es nicht zulassen, da&szlig;
  Patente die Entwicklung und Anwendung von Software f&uuml;r allgemein
  einsetzbare Computer einschr&auml;nken, aber in Staaten, wo dies
  geschieht, wollen wir die spezielle Gefahr vermeiden, da&szlig; Patente
  dazu verwendet werden, ein freies Programm im Endeffekt propriet&auml;r
  zu machen. Um dies zu verhindern, stellt die GPL sicher, da&szlig;
  Patente nicht verwendet werden k&ouml;nnen, um das Programm nicht-frei
  zu machen.
<br/><br/>
  Es folgen die pr&auml;zisen Bedingungen f&uuml;r das Kopieren, Verbreiten
  und Modifizieren.
<br/><br/>

<h2>LIZENZBEDINGUNGEN</h2>

<h3>0. Definitionen</h3>
  &bdquo;Diese Lizenz&ldquo; bezieht sich auf die Version&nbsp;3
  der GNU General Public License.
<br/><br/>
  Mit &bdquo;Urheberrecht&ldquo; sind auch urheberrecht&auml;hnliche
  Rechte gemeint, die auf andere Arten von Werken Anwendung finden,
  beispielsweise auf Fotomasken in der Halbleitertechnologie.
<br/><br/>
  &bdquo;Das Programm&ldquo; bezeichnet jedes urheberrechtlich
  sch&uuml;tzbare Werk, das unter diese Lizenz gestellt wurde. Jeder
  Lizenznehmer wird als &bdquo;Sie&ldquo; angeredet.
  &bdquo;Lizenznehmer&ldquo; und &bdquo;Empf&auml;nger&ldquo; k&ouml;nnen
  nat&uuml;rliche oder rechtliche Personen sein.
<br/><br/>
  Ein Werk zu &bdquo;modifizieren&ldquo; bedeutet, aus einem Werk zu
  kopieren oder es ganz oder teilweise auf eine Weise umzuarbeiten,
  die eine urheberrechtliche Erlaubnis erfordert und kein
  Eins-zu-eins-Kopieren darstellt. Das daraus hervorgehende Werk
  wird als &bdquo;modifizierte Version&ldquo; des fr&uuml;heren Werks
  oder als auf dem fr&uuml;heren Werk &bdquo;basierendes&ldquo; Werk
  bezeichnet.
<br/><br/>
  Ein &bdquo;betroffenes Werk&ldquo; bezeichnet entweder das
  unmodifizierte Programm oder ein auf dem Programm basierendes
  Werk.
<br/><br/>
  Ein Werk zu &bdquo;propagieren&ldquo; bezeichnet jedwede Handlung
  mit dem Werk, f&uuml;r die man, wenn unerlaubt begangen, wegen
  Verletzung anwendbaren Urheberrechts direkt oder indirekt zur
  Verantwortung gezogen w&uuml;rde, ausgenommen das Ausf&uuml;hren auf einem
  Computer oder das Modifizieren einer privaten Kopie. Unter das
  Propagieren eines Werks fallen Kopieren, Weitergeben (mit oder
  ohne Modifikationen), &ouml;ffentliches Zug&auml;nglichmachen und in manchen
  Staaten noch weitere T&auml;tigkeiten.
<br/><br/>
  Ein Werk zu &bdquo;&uuml;bertragen&ldquo; bezeichnet jede Art von
  Propagation, die es Dritten erm&ouml;glicht, das Werk zu kopieren oder
  Kopien zu erhalten. Reine Interaktion mit einem Benutzer &uuml;ber ein
  Computer-Netzwerk ohne &Uuml;bergabe einer Kopie ist keine &Uuml;bertragung.
<br/><br/>
  Eine interaktive Benutzerschnittstelle zeigt &bdquo;angemessene
  rechtliche Hinweise&ldquo; in dem Umfang, da&szlig; sie eine
  zweckdienliches und deutlich sichtbare Funktion bereitstellt, die
  (1) einen angemessenen Copyright-Vermerk zeigt und (2) dem
  Benutzer mitteilt, da&szlig; keine Garantie f&uuml;r das Werk besteht
  (ausgenommen in dem Umfang, in dem Garantie gew&auml;hrt wird), da&szlig;
  Lizenznehmer das Werk gem&auml;&szlig; dieser Lizenz &uuml;bertragen
  d&uuml;rfen und
  wie man ein Exemplar dieser Lizenz zu Gesicht bekommen kann. Wenn
  die Benutzerschnittstelle eine Liste von Benutzerkommandos oder
  Optionen anzeigt, zum Beispiel ein Men&uuml;, dann erf&uuml;llt ein deutlich
  sichtbarer Punkt in dieser Liste dieses Kriterium.
<br/><br/>

<h3>1. Quelltext</h3>
  Der &bdquo;Quelltext&ldquo; eines Werkes bezeichnet diejenige Form
  des Werkes, die f&uuml;r Bearbeitungen vorzugsweise verwendet wird.
  &bdquo;Objekt-Code&ldquo; bezeichnet jede Nicht-Quelltext-Form
  eines Werks.
<br/><br/>
  Eine &bdquo;Standardschnittstelle&ldquo; bezeichnet eine
  Schnittstelle, die entweder ein offizieller Standard eines
  anerkannten Standardisierungsgremiums ist oder &ndash; im Falle
  von Schnittstellen, die f&uuml;r eine spezielle Programmiersprache
  spezifiziert wurden &ndash; eine Schnittstelle, die unter
  Entwicklern, die in dieser Programmiersprache arbeiten, weithin
  gebr&auml;uchlich ist.
<br/><br/>
  Die &bdquo;Systembibliotheken&ldquo; eines ausf&uuml;hrbaren Werks
  enthalten alles, ausgenommen das Werk als Ganzes, was (a)
  normalerweise zum Lieferumfang einer Hauptkomponente geh&ouml;rt, aber
  selbst nicht die Hauptkomponente ist, und (b) ausschlie&szlig;lich dazu
  dient, das Werk zusammen mit der Hauptkomponente benutzen zu
  k&ouml;nnen oder eine Standardschnittstelle zu implementieren, f&uuml;r die
  eine Implementation als Quelltext &ouml;ffentlich erh&auml;ltlich ist. Eine
  &bdquo;Hauptkomponente&ldquo; bezeichnet in diesem Zusammenhang
  eine gr&ouml;&szlig;ere wesentliche Komponente (Betriebssystemkern,
  Fenstersystem usw.) des spezifischen Betriebssystems (soweit
  vorhanden), auf dem das ausf&uuml;hrbare Werk l&auml;uft, oder des
  Compilers, der zur Erzeugung des Objekt-Codes eingesetzt wurde,
  oder des f&uuml;r die Ausf&uuml;hrung verwendeten Objekt-Code-Interpreters.
<br/><br/>
  Der &bdquo;korrespondierende Quelltext&ldquo; eines Werks in Form
  von Objekt-Code bezeichnet den vollst&auml;ndigen Quelltext, der
  ben&ouml;tigt wird, um das Werk zu erzeugen, es zu installieren, um (im
  Falle eines ausf&uuml;hrbaren Werks) den Objekt-Code auszuf&uuml;hren und um
  das Werk zu modifizieren, einschlie&szlig;lich der Skripte zur Steuerung
  dieser Aktivit&auml;ten. Er schlie&szlig;t jedoch nicht die
  Systembibliotheken, allgemein einsetzbare Werkzeuge oder allgemein
  erh&auml;ltliche freie Computerprogramme mit ein, die in
  unmodifizierter Form verwendet werden, um die o.a. T&auml;tigkeiten
  durchzuf&uuml;hren, die aber nicht Teil des Werks sind. Zum Beispiel
  enth&auml;lt der korrespondierende Quelltext die zum Programmquelltext
  geh&ouml;renden Schnittstellendefinitionsdateien sowie die Quelltexte
  von dynamisch eingebundenen Bibliotheken und Unterprogrammen, auf
  die das Werk konstruktionsbedingt angewiesen ist, beispielsweise
  durch komplexe Datenkommunikation oder Ablaufsteuerung zwischen
  diesen Unterprogrammen und anderen Teilen des Werks.
<br/><br/>
  Der korrespondierende Quelltext braucht nichts zu enthalten, das
  der Anwender aus anderen Teilen des korrespondierenden Quelltextes
  automatisch regenerieren kann.
<br/><br/>
  Der korrespondierende Quelltext eines Werks in Quelltextform ist
  das Werk selbst.
<br/><br/>

<h3>2. Grundlegende Genehmigungen</h3>
  Alle unter dieser Lizenz gew&auml;hrten Rechte werden gew&auml;hrt auf
  Grundlage des Urheberrechts an dem Programm, und sie sind
  unwiderruflich, solange die festgelegten Bedingungen erf&uuml;llt sind.
  Diese Lizenz erkl&auml;rt ausdr&uuml;cklich Ihr uneingeschr&auml;nktes
  Recht zur Ausf&uuml;hrung des unmodifizierten Programms.
  Die beim Ausf&uuml;hren eines
  betroffenen Werks erzeugten Ausgabedaten fallen unter diese Lizenz
  nur dann, wenn sie, in Anbetracht ihres Inhalts, ein betroffenes
  Werk darstellen. Diese Lizenz erkennt Ihr im Urheberrecht
  vorgesehenes Recht auf angemessene Benutzung &ndash; oder seine
  Entsprechung &ndash; an.
<br/><br/>
  Sie d&uuml;rfen betroffene Werke, die Sie nicht &uuml;bertragen,
  uneingeschr&auml;nkt erzeugen, ausf&uuml;hren und propagieren, solange Ihre
  Lizenz ansonsten in Kraft bleibt. Sie d&uuml;rfen betroffene Werke an
  Dritte &uuml;bertragen f&uuml;r den einzigen Zweck, Modifikationen exklusiv
  f&uuml;r Sie durchzuf&uuml;hren oder Einrichtungen f&uuml;r Sie
  bereitzustellen, um diese Werke auszuf&uuml;hren, vorausgesetzt,
  Sie erf&uuml;llen alle Bedingungen dieser Lizenz f&uuml;r
  das &Uuml;bertragen von Material, dessen Urheberrecht nicht bei Ihnen liegt.
  Diejenigen, die auf diese Weise betroffene Werke f&uuml;r Sie anfertigen
  oder ausf&uuml;hren, m&uuml;ssen dies ausschlie&szlig;lich
  in Ihrem Namen tun, unter Ihrer Anleitung und
  Kontrolle und unter Bedingungen, die ihnen verbieten, au&szlig;erhalb
  ihrer Beziehung zu Ihnen weitere Kopien Ihres urheberrechtlich
  gesch&uuml;tzten Materials anzufertigen.
<br/><br/>
  &Uuml;bertragung ist in jedem Fall ausschlie&szlig;lich unter den unten
  aufgef&uuml;hrten Bedingungen gestattet. Unterlizensierung ist nicht
  gestattet, ist aber wegen &sect;10 unn&ouml;tig.
<br/><br/>

<h3>3. Schutz von Anwenderrechten vor Umgehungsverbotgesetzen</h3>
  Kein betroffenes Werk darf als Teil eines wirksamen technischen
  Mechanismus' unter jedwedem anwendbarem Recht betrachtet werden,
  das die Auflagen von Artikel 11 des am 20. Dezember 1996
  verabschiedeten WIPO-Urheberrechtsvertrags oder unter
  vergleichbaren Gesetzen, die die Umgehung derartiger Mechanismen
  verbietet oder einschr&auml;nkt.
<br/><br/>
  Wenn Sie ein betroffenes Werk &uuml;bertragen, verzichten Sie auf jedes
  Recht, die Umgehung technischer Mechanismen zu verbieten, insoweit
  diese Umgehung durch die Aus&uuml;bung der von dieser Lizenz gew&auml;hrten
  Rechte in bezug auf das betroffene Werk herbeigef&uuml;hrt wird, und
  Sie weisen jede Absicht von sich, die Benutzung oder Modifikation
  des Werks zu beschr&auml;nken, um Ihre Rechtsanspr&uuml;che oder
  Rechtsanspr&uuml;che Dritter zum Verbot der Umgehung technischer
  Mechanismen gegen die Anwender des Werks durchzusetzen.
<br/><br/>

<h3>4. Unver&auml;nderte Kopien</h3>
  Sie d&uuml;rfen auf beliebigen Medien unver&auml;nderte Kopien des
  Quelltextes des Programms, wie sie ihn erhalten, &uuml;bertragen,
  sofern Sie auf deutliche und angemessene Weise auf jeder Kopie
  einen angemessenen Urheberrechts-Vermerk ver&ouml;ffentlichen, alle
  Hinweise intakt lassen, da&szlig; diese Lizenz und s&auml;mtliche
  gem&auml;&szlig;
  &sect;7 hinzugef&uuml;gten Einschr&auml;nkungen auf den Quelltext anwendbar
  sind, alle Hinweise auf das Nichtvorhandensein einer Garantie
  intakt lassen und allen Empf&auml;ngern gemeinsam mit dem Programm ein
  Exemplar dieser Lizenz  zukommen lassen.
<br/><br/>
  Sie d&uuml;rfen f&uuml;r jede &uuml;bertragene Kopie ein Entgelt &ndash;
  oder auch kein Entgelt &ndash; verlangen, und Sie d&uuml;rfen Kundendienst-
  oder Garantieleistungen gegen Entgelt anbieten.
<br/><br/>

<h3>5. &Uuml;bertragung modifizierter Quelltextversionen</h3>
  Sie d&uuml;rfen ein auf dem Programm basierendes Werk oder die n&ouml;tigen
  Modifikationen, um es aus dem Programm zu generieren, kopieren und
  &uuml;bertragen in Form von Quelltext unter den Bestimmungen von
  &sect;4, vorausgesetzt, da&szlig; Sie zus&auml;tzlich alle im folgenden
  genannten Bedingungen erf&uuml;llen:
<br/><br/>
  <table cellspacing="5">
    <tr>
      <td align="right" valign="top">a)</td>
      <td>
	Das ver&auml;nderte Werk mu&szlig; auff&auml;llige Vermerke tragen,
	die besagen, da&szlig; Sie es modifiziert haben, und die ein darauf
	bezogenes Datum angeben.
      </td>
    </tr>
    <tr>
      <td align="right" valign="top">b)</td>
      <td>
	Das ver&auml;nderte Werk mu&szlig; auff&auml;llige Vermerke tragen,
	die besagen, da&szlig; es unter dieser Lizenz einschlie&szlig;lich
	der gem&auml;&szlig; &sect;7 hinzugef&uuml;gten Bedingungen
	herausgegeben wird.
	Diese Anforderung wandelt die Anforderung aus &sect;4 ab, &bdquo;alle
	Hinweise intakt zu lassen&ldquo;.
      </td>
    </tr>
    <tr>
      <td align="right" valign="top">c)</td>
      <td>
	Sie m&uuml;ssen das Gesamtwerk als Ganzes gem&auml;&szlig; dieser
	Lizenz an jeden lizensieren, der in den Besitz einer Kopie gelangt.
	Diese Lizenz wird daher &ndash; ggf. einschlie&szlig;lich
	zus&auml;tzlicher Bedingungen gem&auml;&szlig; &sect;7 &ndash;
	f&uuml;r das Werk als Ganzes und
	alle seine Teile gelten, unabh&auml;ngig davon, wie diese
	zusammengepackt werden. Diese Lizenz erteilt keine Erlaubnis,
	das Werk in irgendeiner anderen Weise zu lizensieren, setzt
	aber eine derartige Erlaubnis nicht au&szlig;er Kraft, wenn Sie sie
	diese gesondert erhalten haben.
      </td>
    </tr>
    <tr>
      <td align="right" valign="top">d)</td>
      <td>
	Wenn das Werk &uuml;ber interaktive Benutzerschnittstellen
	verf&uuml;gt,
	m&uuml;ssen diese jeweils angemessene rechtliche Hinweise anzeigen.
	Wenn allerdings das Programm interaktive Benutzerschnittstellen
	hat, die keine angemessenen rechtlichen Hinweise anzeigen,
	braucht Ihr Werk nicht daf&uuml;r zu sorgen, da&szlig; sie dies tun.
      </td>
    </tr>
  </table>
<br/><br/>
  Die Zusammenstellung eines betroffenen Werks mit anderen
  gesonderten und unabh&auml;ngigen Werken, die nicht ihrer Natur nach
  Erweiterungen des betroffenen Werks sind und die nicht mit ihm in
  einer Weise kombiniert sind, um ein gr&ouml;&szlig;eres Programm zu bilden,
  in oder auf einem
  Speicher- oder Verbreitungsmedium wird als &bdquo;Aggregat&ldquo;
  bezeichnet, wenn die Zusammenstellung und das sich f&uuml;r
  sie ergebende Urheberrecht nicht dazu verwendet werden, den
  Zugriff oder die Rechte der Benutzer der Zusammenstellung weiter
  einzuschr&auml;nken, als dies die einzelnen Werke erlauben. Die
  Aufnahme des betroffenen Werks in ein Aggregat sorgt nicht daf&uuml;r,
  da&szlig; diese Lizenz auf die anderen Teile des Aggregats wirke.
<br/><br/>

<h3>6. &Uuml;bertragung in Nicht-Quelltext-Form</h3>
  Sie d&uuml;rfen ein betroffenes Werk in Form von Objekt-Code unter den
  Bedingungen der Paragraphen 4 und 5 kopieren und &uuml;bertragen
  &ndash; vorausgesetzt, da&szlig; Sie au&szlig;erdem den maschinenlesbaren
  korrespondierenden Quelltext unter den Bedingungen dieser Lizenz
  &uuml;bertragen auf eine der folgenden Weisen:
<br/><br/>
  <table cellspacing="5">
    <tr>
      <td align="right" valign="top">a)</td>
      <td>
	Sie &uuml;bertragen den Objekt-Code in einem physikalischen Produkt
	(einschlie&szlig;lich ein physikalisches Speichermedium) gemeinsam
	mit dem korrespondierenden Quelltext, der sich unver&auml;nderlich
	auf einem haltbaren physikalischen Medium befindet, das
	&uuml;blicherweise f&uuml;r den Austausch von Software verwendet wird.
      </td>
    </tr>
    <tr>
      <td align="right" valign="top">b)</td>
      <td>
	Sie &uuml;bertragen den Objekt-Code in einem physikalischen Produkt
	(einschlie&szlig;lich ein physikalisches Speichermedium) gemeinsam
	mit einem schriftlichen Angebot, das mindestens drei Jahre lang
	g&uuml;ltig sein mu&szlig; und so lange, wie Sie Ersatzteile und
	Kundendienst f&uuml;r dieses Produktmodell anbieten, jedem, der im
	Besitz des Objekt-Codes ist, entweder (1) eine Kopie des
	korrespondierenden Quelltextes der gesamten Software, die in
	dem Produkt enthalten und von dieser Lizenz betroffen ist, zur
	Verf&uuml;gung zu stellen &ndash; auf einem haltbaren physikalischen
	Medium, das &uuml;blicherweise f&uuml;r den Austausch von Software
	verwendet wird, und zu nicht h&ouml;heren Kosten als denen, die
	begr&uuml;ndbar durch den physikalischen Vorgang der &Uuml;bertragung
	des Quelltextes anfallen, oder (2) kostenlosen Zugriff, um den
	korrespondierenden Quelltext von einem Netzwerk-Server zu
	kopieren.
      </td>
    </tr>
    <tr>
      <td align="right" valign="top">c)</td>
      <td>
	Sie &uuml;bertragen Kopien des Objekt-Codes gemeinsam mit einer
	Kopie des schriftlichen Angebots, den korrespondierenden
	Quelltext zur Verf&uuml;gung zu stellen. Diese Alternative ist nur
	f&uuml;r gelegentliche, nicht-kommerzielle &Uuml;bertragung
	zul&auml;ssig und nur, wenn Sie den Objekt-Code als mit einem
	entsprechenden Angebot gem&auml;&szlig; Absatz 6b erhalten haben.
      </td>
    </tr>
    <tr>
      <td align="right" valign="top">d)</td>
      <td>
	Sie &uuml;bertragen den Objekt-Code dadurch, da&szlig; Sie Zugriff auf
	eine daf&uuml;r vorgesehene Stelle gew&auml;hren, und bieten
	gleichwertigen Zugriff auf den korrespondierenden Quelltext
	auf gleichem Weg auf dieselbe Stelle und ohne zus&auml;tzliche
	Kosten. Sie m&uuml;ssen nicht von den Empf&auml;ngern verlangen, den
	korrespondierenden Quelltext gemeinsam mit dem Objekt-Code zu
	kopieren. Wenn es sich bei der f&uuml;r das Kopieren vorgesehenen
	Stelle um einen Netzwerk-Server handelt, darf sich der
	korrespondierende Quelltext auf einem anderen Server befinden
	(von Ihnen oder von einem Dritten betrieben), der
	gleichwertige Kopierm&ouml;glichkeiten unterst&uuml;tzt &ndash;
	vorausgesetzt Sie legen dem Objekt-Code klare Anleitungen bei,
	die besagen, wo der korrespondierende Quelltext zu finden ist.
	Unabh&auml;ngig davon, welcher Netzwerk-Server den
	korrespondierenden Quelltext beherbergt, bleiben Sie
	verpflichtet, sicherzustellen, da&szlig; dieser lange genug
	bereitgestellt wird, um diesen Bedingungen zu gen&uuml;gen.
      </td>
    </tr>
    <tr>
      <td align="right" valign="top">e)</td>
      <td>
	Sie &uuml;bertragen den Objekt-Code unter Verwendung von
	Peer-To-Peer-&Uuml;bertragung &ndash; vorausgesetzt, Sie informieren
	andere Teilnehmer dar&uuml;ber, wo der Objekt-Code und der
	korrespondierende Quelltext des Werks unter den Bedingungen von
	Absatz 6d &ouml;ffentlich und kostenfrei angeboten werden.
      </td>
    </tr>
  </table>
<br/><br/>
  Ein abtrennbarer Anteil des Objekt-Codes, dessen Quelltext von dem
  korrespondierenden Quelltext als Systembibliothek ausgeschlossen
  ist, braucht bei der &Uuml;bertragung des Werks als Objekt-Code nicht
  miteinbezogen zu werden.
<br/><br/>
  Ein &bdquo;Benutzerprodukt&ldquo; ist entweder (1) ein
  &bdquo;Endbenutzerprodukt&ldquo;, womit ein materieller
  pers&ouml;nlicher Besitz gemeint ist, der normalerweise f&uuml;r den
  pers&ouml;nlichen oder famili&auml;ren Gebrauch oder im Haushalt eingesetzt
  wird, oder (2) alles, was f&uuml;r den Einbau in eine Wohnung hin
  entworfen oder daf&uuml;r verkauft wird. Bei der Entscheidung, ob ein
  Produkt ein Endbenutzerprodukt ist, sollen Zweifelsf&auml;lle als
  erfa&szlig;t gelten. Wenn ein spezieller Anwender ein spezielles Produkt
  erh&auml;lt, bezeichnet &bdquo;normalerweise einsetzen&ldquo; eine
  typische oder weitverbreitete Anwendung dieser Produktklasse,
  unabh&auml;ngig vom Status des speziellen Anwenders oder der Art und
  Weise, wie der spezielle Anwender des spezielle Produkt
  tats&auml;chlich einsetzt oder wie von ihm erwartet wird, da&szlig; er es
  einsetzt. Ein Produkt gilt als Endbenutzerprodukt unabh&auml;ngig
  davon, ob es substantiellen kommerziellen, industriellen oder
  nicht-endbenutzerspezifischen Nutzen hat, es sei denn, dieser
  Nutzen stellt das einzige signifikante Anwendungsgebiet des
  Produkts dar.
<br/><br/>
  Mit &bdquo;Installationsinformationen&ldquo; f&uuml;r ein
  Benutzerprodukt sind jedwede Methoden, Prozeduren,
  Berechtigungsschl&uuml;ssel oder andere informationen gemeint, die
  notwendig sind, um modifizierte Versionen eines betroffenen Werks,
  die aus einer modifizierten Version seines korrespondierenden
  Quelltextes hervorgegangen sind, auf dem Produkt zu installieren
  und auszuf&uuml;hren. Die Informationen m&uuml;ssen ausreichen, um
  sicherzustellen, da&szlig; das Weiterfunktionieren des modifizierten
  Objekt-Codes in keinem Fall verhindert oder gest&ouml;rt wird aus dem
  einzigen Grunde, weil Modifikationen vorgenommen worden sind.
<br/><br/>
  Wenn Sie Objekt-Code gem&auml;&szlig; diesem Paragraphen innerhalb oder
  zusammen mit oder speziell f&uuml;r den Gebrauch innerhalb eines
  Benutzerprodukts &uuml;bertragen und die &Uuml;bertragung als Teil einer
  Transaktion stattfindet, in der das Recht auf den Besitz und die
  Benutzung des Benutzerprodukts dauerhaft auf den Empf&auml;nger
  &uuml;bergeht (unabh&auml;ngig davon, wie diese Transaktion charakterisiert
  ist), m&uuml;ssen dem gem&auml;&szlig; diesem Paragraphen
  mit&uuml;bertragenen korrespondierenden Quelltext die
  Installationsinformationen beiliegen.
  Diese Anforderung gilt jedoch nicht, wenn weder Sie
  noch irgendeine Drittpartei die M&ouml;glichkeit beh&auml;lt, modifizierten
  Objekt-Code auf dem Benutzerprodukt zu installieren (zum Beispiel,
  wenn das Werk in einem ROM installiert wurde).
<br/><br/>
  Die Anforderung, Installationsinformationen bereitzustellen,
  schlie&szlig;t keine Anforderung mit ein, weiterhin Kundendienst,
  Garantie oder Updates f&uuml;r ein Werk bereitzustellen, das vom
  Empf&auml;nger modifiziert oder installiert worden ist, oder f&uuml;r das
  Benutzerprodukt, in dem das Werk modifiziert oder installiert
  worden ist. Der Zugriff auf ein Computer-Netzwerk darf verweigert
  werden, wenn die Modifikation selbst die Funktion des Netzwerks
  grundlegend nachteilig beeinflu&szlig;t oder wenn sie die Regeln und
  Protokolle f&uuml;r die Kommunikation &uuml;ber das Netzwerk verletzt.
<br/><br/>
  Der korrespondierende Quelltext und die
  Installationsinformationen, die in &Uuml;bereinstimmung mit diesem
  Paragraphen &uuml;bertragen werden, m&uuml;ssen in einem &ouml;ffentlich
  dokumentierten Format vorliegen (f&uuml;r das eine Implementation in
  Form von Quelltext &ouml;ffentlich zug&auml;nglich ist), und sie d&uuml;rfen
  keine speziellen Passw&ouml;rter oder Schl&uuml;ssel f&uuml;r das Auspacken,
  Lesen oder Kopieren erfordern.
<br/><br/>

<h3>7. Zus&auml;tzliche Bedingungen</h3>
  &bdquo;Zus&auml;tzliche Genehmigungen&ldquo; sind Bedingungen, die die
  Bedingungen dieser Lizenz erg&auml;nzen, indem sie Ausnahmen von einer
  oder mehreren Auflagen zulassen. Zus&auml;tzliche Genehmigungen zur
  Anwendung auf das gesamte Programm sollen so betrachtet werden,
  als w&auml;ren sie in dieser Lizenz enthalten, soweit dies unter
  anwendbarem Recht zul&auml;ssig ist. Wenn zus&auml;tzliche Genehmigungen nur
  f&uuml;r einen Teil des Programms gelten, darf dieser Teil separat
  unter diesen Genehmigungen verwendet werden; das gesamte Programm
  jedoch unterliegt weiterhin dieser Lizenz ohne Beachtung der
  zus&auml;tzlichen Genehmigungen.
<br/><br/>
  Ungeachtet jeglicher anderer Regelungen dieser Lizenz d&uuml;rfen Sie
  f&uuml;r Material, das Sie einem betroffenen Werk hinzuf&uuml;gen (sofern
  Sie durch die Urheberrechtsinhaber dieses Materials autorisiert
  sind), die Bedingungen dieser Lizenz um folgendes erg&auml;nzen:
<br/><br/>
  <table cellspacing="5">
    <tr>
      <td align="right" valign="top">a)</td>
      <td>
	Gew&auml;hrleistungsausschlu&szlig; oder Haftungsbegrenzung
	abweichend von &sect;&sect;15 und 16 dieser Lizenz oder
      </td>
    </tr>
    <tr>
      <td align="right" valign="top">b)</td>
      <td>
	die Anforderung, spezifizierte sinnvolle rechtliche Hinweise
	oder Autorenschaftshinweise in diesem Material oder in den
	angemessenen rechtlichen Hinweisen, die von den sie enthaltenen
	Werken angezeigt werden, zu erhalten, oder
      </td>
    </tr>
    <tr>
      <td align="right" valign="top">c)</td>
      <td>
	das Verbot, die Herkunft des Materials falsch darzustellen oder
	die Anforderung, da&szlig; modifizierte Versionen des Materials auf
	angemessens Weise als vom Original verschieden markiert werden,
	oder
      </td>
    </tr>
    <tr>
      <td align="right" valign="top">d)</td>
      <td>
	Begrenzung der Verwendung der Namen von Lizenzgebern oder
	Autoren des Materials f&uuml;r Werbezwecke oder
      </td>
    </tr>
    <tr>
      <td align="right" valign="top">e)</td>
      <td>
	das Zur&uuml;ckweisen der Einr&auml;umung von Rechten gem&auml;&szlig;
	dem Markenrecht zur Benutzung gewisser Produktnamen, Produkt- oder
	Service-Marken oder
      </td>
    </tr>
    <tr>
      <td align="right" valign="top">f)</td>
      <td>
	die Erfordernis der Freistellung des Lizenznehmers und der
	Autoren des Materials durch jeden, der die Software (oder
	modifizierte Versionen davon) &uuml;bertr&auml;gt, mit vertraglichen
	Pr&auml;missen der Verantwortung gegen&uuml;ber dem Empf&auml;nger
	f&uuml;r jede Verantwortung,
	die diese vertraglichen Pr&auml;missen diesen
	Lizenzgebern und Autoren direkt auferlegen.
      </td>
    </tr>
  </table>
<br/><br/>
  Alle anderen hinzugef&uuml;gten einschr&auml;nkenden Bedingungen werden als
  &bdquo;zus&auml;tzliche Einschr&auml;nkungen&ldquo; im Sinne von &sect;10
  betrachtet. Wenn das Programm, wie Sie es erhalten haben, oder ein
  Teil davon dieser Lizenz untersteht zuz&uuml;glich einer weiteren
  Bedingung, die eine zus&auml;tzliche Einschr&auml;nkung darstellt,
  d&uuml;rfen
  Sie diese Bedingung entfernen. Wenn ein Lizenzdokument eine
  zus&auml;tzliche Einschr&auml;nkung enth&auml;lt, aber die Relizensierung
  unter dieser Lizenz erlaubt, d&uuml;rfen Sie dem betroffenen Werk Material
  hinzuf&uuml;gen, das den Bedingungen jenes Lizenzdokuments unterliegt,
  unter der Voraussetzung, da&szlig; die zus&auml;tzlichen
  Einschr&auml;nkungen bei einer derartigen Relizensierung oder
  &Uuml;bertragung verfallen.
<br/><br/>
  Wenn Sie einem betroffenen Werk in &Uuml;bereinstimmung mit diesem
  Paragraphen Bedingungen hinzuf&uuml;gen, m&uuml;ssen Sie in den betroffenen
  Quelltextdateien eine Aufstellung der zus&auml;tzlichen Bedingungen
  plazieren, die auf diese Quelltextdatei Anwendung finden, oder
  einen Hinweis darauf, wo die Zus&auml;tzlichen Bedingungen zu finden
  sind.
<br/><br/>
  Zus&auml;tzliche Bedingungen, seien es Genehmigungen oder
  Einschr&auml;nkungen, d&uuml;rfen in Form einer separaten schriftlichen
  Lizenz oder in Form von Ausnahmen festgelegt werden; die o.a.
  Anforderungen gelten in jedem Fall.
<br/><br/>

<h3>8. K&uuml;ndigung</h3>
  Sie d&uuml;rfen das Programm nicht verbreiten oder modifizieren, sofern
  es nicht durch diese Lizenz ausdr&uuml;cklich gestattet ist. Jeder
  anderweitige Versuch der Verbreitung oder Modifizierung ist
  nichtig und beendet automatisch Ihre Rechte unter dieser Lizenz
  (einschlie&szlig;lich aller Patentlizenzen gem&auml;&szlig; &sect;11 Abs. 3).
<br/><br/>
  Wenn Sie jedoch alle Verletzungen dieser Lizenz beenden, wird Ihre
  Lizenz durch einen speziellen Urheberrechtsinhaber
  wiederhergestellt, und zwar (a) vor&uuml;bergehend, solange nicht bzw.
  bis der Rechteinhaber Ihre Lizenz ausdr&uuml;cklich und endg&uuml;ltig
  k&uuml;ndigt, und (b) dauerhaft, sofern es der Rechteinhaber vers&auml;umt,
  Sie auf sinnvolle Weise auf die Lizenzverletzung innerhalb von 60
  Tagen ab deren Beendigung hinzuweisen.
<br/><br/>
  Dar&uuml;berhinaus wird Ihre Lizenz durch einen speziellen
  Urheberrechtsinhaber permanent wiederhergestellt, wenn Sie der
  Rechteinhaber auf sinnvolle Weise auf die Verletzung hinweist,
  wenn au&szlig;erdem dies das erste Mal ist, da&szlig; Sie auf die Verletzung
  dieser Lizenz (f&uuml;r jedes Werk) des Rechteinhabers hingewiesen
  werden, und wenn Sie die Verletzung innerhalb von 30 Tagen ab dem
  Eingang des Hinweises einstellen.
<br/><br/>
  Die Beendigung Ihrer Rechte unter dieser Lizenz beendet nicht die
  Lizenzen Dritter, die von Ihnen Kopien oder Rechte unter dieser
  Lizenz erhalten haben. Wenn Ihre Rechte beendet und nicht
  dauerhaft wiederhergestellt worden sind, sind Sie nicht berechtigt,
  neue Lizenzen f&uuml;r dasselbe Material gem&auml;&szlig; &sect;10 zu
  erhalten.
<br/><br/>

<h3>
  9. Annahme der Lizenz keine Voraussetzung f&uuml;r den Besitz von Kopien
</h3>
  Um eine Kopie des Programms auszuf&uuml;hren, ist es nicht
  erforderlich, da&szlig; Sie diese Lizenz annehmen. Die nebenbei
  stattfindende Verbreitung eines betroffenen Werks, die sich
  ausschlie&szlig;lich als Konsequenz der Teilnahme an einer
  Peer-To-Peer-Daten&uuml;bertragung ergibt, um eine Kopie entgegennehmen
  zu k&ouml;nnen, erfordert ebenfalls keine Annahme dieser Lizenz. Jedoch
  gibt Ihnen nichts au&szlig;er dieser Lizenz die Erlaubnis, das Programm
  oder jedes betroffene Werk zu verbreiten oder zu ver&auml;ndern. Diese
  Handlungen versto&szlig;en gegen das Urheberrecht, wenn Sie diese Lizenz
  nicht anerkennen. Indem Sie daher ein betroffenes Werk ver&auml;ndern
  oder propagieren, erkl&auml;ren Sie Ihr Einverst&auml;ndnis mit dieser
  Lizenz, die Ihnen diese T&auml;tigkeiten erlaubt.
<br/><br/>

<h3>10. Automatische Lizensierung nachgeordneter Anwender</h3>
  Jedesmal, wenn Sie ein betroffenes Werk &uuml;bertragen, erh&auml;lt der
  Empf&auml;nger automatisch vom urspr&uuml;nglichen Lizenzgeber die Lizenz,
  das Werk auszuf&uuml;hren, zu ver&auml;ndern und zu propagieren &ndash; in
  &Uuml;bereinstimmung mit dieser Lizenz. Sie sind nicht daf&uuml;r
  verantwortlich, die Einhaltung dieser Lizenz durch Dritte
  durchzusetzen.
<br/><br/>
  Eine &bdquo;Organisations-Transaktion&ldquo; ist entweder eine
  Transaktion, bei der die Kontrolle &uuml;ber eine Organisation oder das
  im wesentlichen gesamte Kapital einer solchen, &uuml;bertragen wird,
  oder sie ist die Aufteilung einer Organisation in mehrere oder die
  Fusion mehrerer Organisationen zu einer. Wenn die Propagation
  eines betroffenen Werks durch eine Organisations-Transaktion
  erfolgt, erh&auml;lt jeder an der Transaktion Beteiligte, der eine
  Kopie des Werks erh&auml;lt, zugleich jedwede Lizenz an dem Werk, die
  der Interessenvorg&auml;nger des Beteiligten hatte, sowie das Recht auf
  den Besitz des korrespondierenden Quelltextes des Werks vom
  Interessenvorg&auml;nger, wenn dieser ihn hat oder mit vertretbarem
  Aufwand beschaffen kann.
<br/><br/>
  Sie d&uuml;rfen keine zus&auml;tzlichen Einschr&auml;nkungen bzgl.
  der Aus&uuml;bung
  der unter dieser Lizenz gew&auml;hrten oder zugesicherten Rechte
  vornehmen. Beispielsweise d&uuml;rfen Sie keine Lizenzgeb&uuml;hr oder
  sonstige Geb&uuml;hr f&uuml;r die Aus&uuml;bung der unter dieser Lizenz
  gew&auml;hrten
  Rechte verlangen, und Sie d&uuml;rfen keine Rechtsstreitigkeit beginnen
  (eingeschlossen Kreuz- oder Gegenanspr&uuml;che in einem
  Gerichtsverfahren), in der Sie unterstellen, da&szlig; irgendein
  Patentanspruch durch Erzeugung, Anwendung, Verkauf,
  Verkaufsangebot oder Import des Programms oder irgendeines Teils
  davon verletzt wurde.
<br/><br/>

<h3>11. Patente</h3>
  Ein &bdquo;Kontributor&ldquo; ist ein Urheberrechtsinhaber, der
  die Benutzung des Programms oder eines auf dem Programm
  basierenden Werks unter dieser Lizenz erlaubt. Das auf diese Weise
  lizensierte Werk bezeichnen wir als die
  &bdquo;Kontributor-Version&ldquo; des Kontributors.
<br/><br/>
  Die &bdquo;wesentlichen Patentanspr&uuml;che&ldquo; eines Kontributors
  sind all diejenigen Patentanspr&uuml;che, die der Kontributor besitzt
  oder kontrolliert, ob bereits erworben oder erst in Zukunft zu
  erwerben, die durch irgendeine Weise des gem&auml;&szlig; dieser Lizenz
  erlaubten Erzeugens, Ausf&uuml;hrens oder Verkaufens seiner
  Kontributor-Version verletzt w&uuml;rden. Dies schlie&szlig;t keine
  Patentanspr&uuml;che ein, die erst als Konsequenz weiterer
  Modifizierung seiner Kontributor-Version entst&uuml;nden. F&uuml;r den Zweck
  dieser Definition schlie&szlig;t "Kontrolle" das Recht mit ein,
  Unterlizenzen f&uuml;r ein Patent zu erteilen auf eine Weise, die mit
  den Erfordernissen dieser Lizenz vereinbar ist.
<br/><br/>
  Jeder Kontributor gew&auml;hrt Ihnen eine nicht-exklusive, weltweite
  und geb&uuml;hrenfreie Patentlizenz gem&auml;&szlig; den wesentlichen
  Patentanspr&uuml;chen des Kontributors, den Inhalt seiner
  Kontributor-Version zu erzeugen, zu verkaufen, zum Verkauf
  anzubieten, zu importieren und au&szlig;erdem auszuf&uuml;hren, zu
  modifizieren und zu propagieren.
<br/><br/>
  In den folgenden drei Abs&auml;tzen ist eine &bdquo;Patentlizenz&ldquo;
  jedwede ausdr&uuml;ckliche Vereinbarung oder Verpflichtung, wie auch
  immer benannt, ein Patent nicht geltend zu machen (beispielsweise
  eine ausdr&uuml;ckliche Erlaubnis, ein Patent zu nutzen oder eine
  Zusicherung, bei Patentverletzung nicht zu klagen). Jemandem eine
  solche Patentlizenz zu &bdquo;erteilen&ldquo; bedeutet, eine
  solche Vereinbarung oder Verpflichtung zu beschlie&szlig;en, ein Patent
  nicht gegen ihn durchzusetzen.
<br/><br/>
  Wenn Sie ein betroffenes Werk &uuml;bertragen, das wissentlich auf
  eine Patentlizenz angewiesen ist, und wenn der korrespondierende
  Quelltext nicht f&uuml;r jeden zum Kopieren zur Verf&uuml;gung gestellt wird
  &ndash; kostenlos, unter den Bedingungen dieser Lizenz und &uuml;ber
  einen &ouml;ffentlich zug&auml;nglichen Netzwerk-Server oder andere leicht
  zug&auml;ngliche Mittel &ndash;, dann m&uuml;ssen Sie entweder (1) daf&uuml;r
  sorgen, da&szlig; der korrespondierende Quelltext auf diese Weise
  verf&uuml;gbar gemacht wird oder (2) daf&uuml;r sorgen, da&szlig; Ihnen
  selbst die Vorteile der Patentlizenz f&uuml;r dieses spezielle Werk entzogen
  werden oder (3) in einer mit den Erfordernissen dieser Lizenz
  vereinbaren Weise bewirken, da&szlig; die Patentlizenz auf nachgeordnete
  Empf&auml;nger ausgedehnt wird. &bdquo;Wissentlich angewiesen
  sein&ldquo; bedeutet, da&szlig; Sie tats&auml;chliches Wissen dar&uuml;ber
  haben, da&szlig; &ndash; au&szlig;er wegen der Patentlizenz &ndash;
  Ihre &Uuml;bertragung des betroffenen Werks in einen Staat oder die Benutzung
  des betroffenen Werks durch Ihren Empf&auml;nger in einem Staat, eins oder
  mehrere identifizierbare Patente in diesem Staat verletzen w&uuml;rden,
  deren G&uuml;ltigkeit Ihnen glaubhaft erscheint.
<br/><br/>
  Wenn Sie, als Folge von oder in Verbindung mit einer einzelnen
  Transaktion oder Vereinbarung, ein betroffenes Werk &uuml;bertragen
  oder durch Vermittlung einer &Uuml;bertragung propagieren, und Sie
  gew&auml;hren einigen Empf&auml;ngern eine Patentlizenz, die ihnen das
  Benutzen, Propagieren, Modifizieren und &Uuml;bertragen einer
  speziellen Kopie des betroffenen Werks gestatten, dann wird die
  von Ihnen gew&auml;hrte Patentlizenz automatisch auf alle Empf&auml;nger des
  betroffenen Werks und darauf basierender Werke ausgedehnt.
<br/><br/>
  Eine Patentlizenz ist &bdquo;diskriminierend&ldquo;, wenn sie in
  ihrem G&uuml;ltigkeitsbereich die speziell unter dieser Lizenz
  gew&auml;hrten Rechte nicht einschlie&szlig;t, wenn sie die Aus&uuml;bung
  dieser Rechte verbietet oder wenn sie die Nichtaus&uuml;bung einer oder
  mehrerer dieser Rechte zur Bedingung hat. Sie d&uuml;rfen ein
  betroffenes Werk nicht &uuml;bertragen, wenn Sie Partner in einem
  Vertrag mit einer Drittpartei sind, die auf dem Gebiet der
  Verbreitung von Software gesch&auml;ftlich t&auml;tig ist, gem&auml;&szlig;
  dem Sie dieser Drittpartei Zahlungen leisten, die auf dem Ma&szlig; Ihrer
  Aktivit&auml;t des &Uuml;bertragens des Werks basieren, und gem&auml;&szlig;
  dem die Drittpartei eine diskriminierende Patentlizenz all denjenigen
  gew&auml;hrt, die das Werk von Ihnen erhielten, (a) in Verbindung mit
  von Ihnen &uuml;bertragenen Kopien des betroffenen Werks (oder Kopien
  dieser Kopien) oder (b) haupts&auml;chlich f&uuml;r und in Verbindung mit
  spezifischen Produkten oder Zusammenstellungen, die das betroffene
  Werk enthalten, es sei denn, Sie sind in diesen Vertrag vor dem
  28. M&auml;rz 2007 eingetreten oder die Patentlizenz wurde vor diesem
  Datum erteilt.
<br/><br/>
  Nichts in dieser Lizenz soll in einer Weise ausgelegt werden, die
  irgendeine implizite Lizenz oder sonstige Abwehr gegen
  Rechtsverletzung ausschlie&szlig;t oder begrenzt, die Ihnen ansonsten
  gem&auml;&szlig; anwendbarem Patentrecht zust&uuml;nde.
<br/><br/>

<h3>12. Keine Preisgabe der Freiheit Dritter</h3>
  Sollten Ihnen (durch Gerichtsbeschlu&szlig;, Vergleich oder anderweitig)
  Bedingungen auferlegt werden, die den Bedingungen dieser Lizenz
  widersprechen, so befreien Sie diese Umst&auml;nde nicht von den
  Bestimmungen dieser Lizenz. Wenn es Ihnen nicht m&ouml;glich ist, ein
  betroffenes Werk unter gleichzeitiger Beachtung der Bedingungen in
  dieser Lizenz und Ihrer anderweitigen Verpflichtungen zu &uuml;bertragen,
  dann d&uuml;rfen Sie als Folge das Programm &uuml;berhaupt nicht
  &uuml;bertragen. Wenn Sie zum Beispiel Bedingungen akzeptieren, die Sie
  dazu verpflichten, von denen, denen Sie das Programm &uuml;bertragen
  haben, eine Geb&uuml;hr f&uuml;r die weitere &Uuml;bertragung einzufordern,
  dann besteht der einzige Weg, sowohl jene Bedingungen als auch diese
  Lizenz zu befolgen darin, ganz auf die &Uuml;bertragung des Programms
  zu verzichten.
<br/><br/>

<h3>13. Nutzung zusammen mit der GNU Affero General Public License</h3>
  Ungeachtet anderer Regelungen dieser Lizenz, ist es Ihnen
  gestattet, ein betroffenes Werk mit einem Werk zu einem einzelnen,
  kombinierten Werk zu verbinden (linken) oder zu kombinieren, das
  unter Version 3 der GNU Affero General Public License steht, und
  das Ergebnis zu &uuml;bertragen. Die Bedingungen dieser Lizenz bleiben
  weiterhin auf denjenigen Teil anwendbar, der das betroffene Werk
  darstellt, aber die speziellen Anforderungen der GNU Affero
  General Public License, &sect;13, die sich auf Interaktion &uuml;ber
  ein Computer-Netzwerk beziehen, werden auf die Kombination als
  solche anwendbar.
<br/><br/>

<h3>14. &Uuml;berarbeitungen dieser Lizenz</h3>
  Die Free Software Foundation kann von Zeit zu Zeit &uuml;berarbeitete
  und/oder neue Versionen der <em>General Public License</em>
  ver&ouml;ffentlichen. Solche neuen Versionen werden vom Grundprinzip
  her der gegenw&auml;rtigen entsprechen, k&ouml;nnen aber im Detail
  abweichen, um neuen Problemen und Anforderungen gerecht zu werden.
<br/><br/>
  Jede Version dieser Lizenz hat eine eindeutige Versionsnummer.
  Wenn in einem Programm angegeben wird, da&szlig; es dieser Lizenz in
  einer bestimmten Versionsnummer &bdquo;oder jeder sp&auml;teren
  Version&ldquo; <em>(&ldquo;or any later version&rdquo;)</em>
  unterliegt, so haben Sie die Wahl, entweder den Bestimmungen der
  genannten Version zu folgen oder denen jeder beliebigen sp&auml;teren
  Version, die von der Free Software Foundation ver&ouml;ffentlicht
  wurde. Wenn das Programm keine Versionsnummer angibt, k&ouml;nnen Sie
  eine beliebige Version w&auml;hlen, die je von der Free Software
  Foundation ver&ouml;ffentlicht wurde.
<br/><br/>

<h3>15. Gew&auml;hrleistungsausschlu&szlig;</h3>
  Es besteht keinerlei Gew&auml;hrleistung f&uuml;r das Programm, soweit dies
  gesetzlich zul&auml;ssig ist. Sofern nicht anderweitig schriftlich
  best&auml;tigt, stellen die Urheberrechtsinhaber und/oder Dritte das
  Programm so zur Verf&uuml;gung, &bdquo;wie es ist&ldquo;, ohne
  irgendeine Gew&auml;hrleistung, weder ausdr&uuml;cklich noch implizit,
  einschlie&szlig;lich &ndash; aber nicht begrenzt auf &ndash; die
  implizite Gew&auml;hrleistung der Marktreife oder der Verwendbarkeit
  f&uuml;r einen bestimmten Zweck. Das volle Risiko bez&uuml;glich
  Qualit&auml;t und Leistungsf&auml;higkeit des Programms liegt bei Ihnen.
  Sollte sich das Programm als fehlerhaft herausstellen,
  liegen die Kosten f&uuml;r notwendigen Service, Reparatur oder Korrektur
  bei Ihnen.
<br/><br/>

<h3>16. Haftungsbegrenzung</h3>
  In keinem Fall, au&szlig;er wenn durch geltendes Recht gefordert oder
  schriftlich zugesichert, ist irgendein Urheberrechtsinhaber oder
  irgendein Dritter, der das Programm wie oben erlaubt modifiziert
  oder &uuml;bertragen hat, Ihnen gegen&uuml;ber f&uuml;r
  irgendwelche Sch&auml;den haftbar,
  einschlie&szlig;lich jeglicher allgemeiner oder spezieller
  Sch&auml;den, Sch&auml;den durch Seiteneffekte (Nebenwirkungen) oder
  Folgesch&auml;den, die aus der Benutzung des Programms oder der
  Unbenutzbarkeit des Programms folgen (einschlie&szlig;lich &ndash; aber
  nicht beschr&auml;nkt auf &ndash; Datenverluste, fehlerhafte
  Verarbeitung von Daten, Verluste, die von Ihnen oder anderen
  getragen werden m&uuml;ssen, oder dem Unverm&ouml;gen des Programms, mit
  irgendeinem anderen Programm zusammenzuarbeiten), selbst wenn ein
  Urheberrechtsinhaber oder Dritter &uuml;ber die M&ouml;glichkeit solcher
  Sch&auml;den unterrichtet worden war.
<br/><br/>

<h3>17. Interpretation von &sect;&sect; 15 und 16</h3>
  Sollten der o.a. Gew&auml;hrleistungsausschlu&szlig; und die o.a.
  Haftungsbegrenzung aufgrund ihrer Bedingungen gem&auml;&szlig; lokalem Recht
  unwirksam sein, sollen Bewertungsgerichte dasjenige lokale Recht
  anwenden, das einer absoluten Aufhebung jeglicher zivilen Haftung
  in Zusammenhang mit dem Programm am n&auml;chsten kommt, es sei denn,
  dem Programm lag eine entgeltliche Garantieerkl&auml;rung oder
  Haftungs&uuml;bernahme bei.
<br/><br/>

<h2>ENDE DER LIZENZBEDINGUNGEN</h2>
<br/><br/>

<h2>
  Wie Sie diese Bedingungen auf Ihre eigenen, neuen Programme
  anwenden k&ouml;nnen
</h2>
  Wenn Sie ein neues Programm entwickeln und wollen, da&szlig; es vom
  gr&ouml;&szlig;tm&ouml;glichen Nutzen f&uuml;r die Allgemeinheit ist,
  dann erreichen Sie das am besten, indem Sie es zu freier Software machen,
  die jeder unter diesen Bestimmungen weiterverbreiten und ver&auml;ndern
  kann.
<br/><br/>
  Um dies zu erreichen, f&uuml;gen Sie die folgenden Vermerke zu Ihrem
  Programm hinzu. Am sichersten ist es, sie an den Anfang einer
  jeden Quelldatei zu stellen, um den Gew&auml;hrleistungsausschlu&szlig;
  m&ouml;glichst deutlich darzustellen; zumindest aber sollte jede Datei
  die &bdquo;Copyright&ldquo;-Zeile besitzen sowie einen kurzen
  Hinweis darauf, wo die vollst&auml;ndigen Vermerke zu finden sind.
<br/>
  <blockquote>
  <p>
    <tt>
      [<i>eine Zeile mit dem Programmnamen und einer kurzen Beschreibung</i>]
      <br/>
      Copyright (C) [<i>Jahr</i>]&nbsp;&nbsp;[<i>Name des Autors</i>]
    </tt>
  </p>
  <p>
    <tt>
      This program is free software; you can redistribute it and/or
      modify it under the terms of the GNU General Public License as
      published by the Free Software Foundation; either version 3 of
      the License, or (at your option) any later version.
    </tt>
  </p>
  <p>
    <tt>
      This program is distributed in the hope that it will be useful,
      but WITHOUT ANY WARRANTY; without even the implied warranty of
      MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU
      General Public License for more details.
    </tt>
  </p>
  <p>
    <tt>
      You should have received a copy of the GNU General Public License
      along with this program; if not, see
      &lt;http://www.gnu.org/licenses/&gt;.
    </tt>
  </p>
  </blockquote>
<br/><br/>
  Auf Deutsch:
<br/>
  <blockquote>
  <p>
    <tt>
      [<i>eine Zeile mit dem Programmnamen und einer kurzen Beschreibung</i>]
      <br/>
      Copyright (C) [<i>Jahr</i>]&nbsp;&nbsp;[<i>Name des Autors</i>]
    </tt>
  </p>
  <p>
    <tt>
      Dieses Programm ist freie Software. Sie k&ouml;nnen es unter den
      Bedingungen der GNU General Public License, wie von der Free
      Software Foundation ver&ouml;ffentlicht, weitergeben und/oder
      modifizieren, entweder gem&auml;&szlig; Version 3 der Lizenz oder (nach
      Ihrer Option) jeder sp&auml;teren Version.
    </tt>
  </p>
  <p>
    <tt>
      Die Ver&ouml;ffentlichung dieses Programms erfolgt in der Hoffnung,
      da&szlig; es Ihnen von Nutzen sein wird, aber OHNE IRGENDEINE GARANTIE,
      sogar ohne die implizite Garantie der MARKTREIFE oder der
      VERWENDBARKEIT F&Uuml;R EINEN BESTIMMTEN ZWECK. Details finden Sie in
      der GNU General Public License.
    </tt>
  </p>
  <p>
    <tt>
      Sie sollten ein Exemplar der GNU General Public License zusammen
      mit diesem Programm erhalten haben. Falls nicht, siehe
      &lt;http://www.gnu.org/licenses/&gt;.
    </tt>
  </p>
  </blockquote>
<br/><br/>
  F&uuml;gen Sie auch einen kurzen Hinweis hinzu, wie Sie elektronisch
  und per Brief erreichbar sind.
<br/><br/>
  Wenn Ihr Programm interaktive Befehle in einem Terminal
  entgegennimmt, sorgen Sie daf&uuml;r, da&szlig; es nach dem Start einen
  kurzen Vermerk ausgibt:
<br/>
  <blockquote>
  <p>
    <tt>
      [Programm]&nbsp;&nbsp;Copyright (C)
      [<i>Jahr</i>]&nbsp;&nbsp;[<i>Name des Autors</i>]<br/>
      This program comes with ABSOLUTELY NO WARRANTY; for details type
      &lsquo;show w&rsquo;.<br/>
      This is free software, and you are welcome to redistribute it
      under certain conditions; type &lsquo;show c&rsquo; for details.
    </tt>
  </p>
  </blockquote>
<br/><br/>
  Auf Deutsch:
<br/>
  <blockquote>
  <p>
    <tt>
      [Programm]&nbsp;&nbsp;Copyright (C)
      [<i>Jahr</i>]&nbsp;&nbsp;[<i>Name des Autors</i>]
      F&uuml;r dieses Programm besteht KEINERLEI GARANTIE; geben Sie
      &quot;show w&quot; f&uuml;r Details ein.<br/>
      Dies ist freie Software, die Sie unter bestimmten Bedingungen
      weitergeben d&uuml;rfen; geben Sie &quot;show c&quot; f&uuml;r Details ein.
    </tt>
  </p>
  </blockquote>
<br/><br/>
  Die hypothetischen Kommandos &bdquo;<code>show w</code>&ldquo; und
  &bdquo;<code>show c</code>&ldquo; sollten die entsprechenden Teile
  der GNU-GPL anzeigen. Nat&uuml;rlich k&ouml;nnen die von Ihnen verwendeten
  Kommandos auch anders lauten; f&uuml;r ein Programm mit graphischer
  Benutzeroberfl&auml;che werden Sie sicherlich eine
  &bdquo;About-Box&ldquo; verwenden.
<br/><br/>
  Soweit vorhanden, sollten Sie auch Ihren Arbeitgeber (wenn Sie als
  Programmierer arbeiten) oder Ihre Schule einen Urheberrechteverzicht
  f&uuml;r das Programm unterschreiben lassen. F&uuml;r weitere Informationen
  dar&uuml;ber und wie Sie die GNU GPL anwenden und befolgen, siehe:
  http://www.gnu.org/licenses/
<br/><br/>
  Diese <em>General Public License</em> gestattet nicht die
  Einbindung Ihres Programms in propriet&auml;re Programme. Wenn Ihr
  Programm eine Funktionsbibliothek ist, dann kann es sinnvoller
  sein, das Linken propriet&auml;rer Programme mit dieser Bibliothek zu
  gestatten. Wenn dies Ihre Absicht ist, sollten Sie die
  <em>GNU Lesser General Public License</em> anstelle dieser Lizenz verwenden.
  Lesen Sie aber bitte vorher:
  http://www.gnu.org/philosophy/why-not-lgpl.html
<br/><br/>
  <p align="center">* * *</p>
<br/><br/>
  Copyright-Notiz des englischsprachigen Orignals:<br/>
  Copyright notice above.<br/>
  51 Franklin Street, Fifth Floor, Boston, MA 02110, USA<br/>
  Verbatim copying and distribution of this entire article is
  permitted in any medium without royalty provided this notice is
  preserved.
<br/><br/>
  &Uuml;bersetzung:<br/>
  Copyright-Notiz siehe oben.<br/>
  51 Franklin Street, Fifth Floor, Boston, MA 02110, USA<br/>
  Es ist geb&uuml;hrenfrei gestattet, diesen Artikel als Ganzes und
  unver&auml;ndert in beliebigen Medien zu kopieren und weiterzugeben,
  sofern dieser Hinweis erhalten bleiben.
</body>
</html>

