<html>
<body>
 <h1>Einstellungen</h1>
  In die Einstellungen gelangen Sie &uuml;ber das Men&uuml;
  <em>Extra</em> &rarr; <em>Einstellungen...</em>.
  Es &ouml;ffnet sich eine Unterseite mit den Einstellungen.
 <br/><br/>

 <h2>1. Gruppierung der einzelnen Einstellungen</h2>
  Die einzelnen Einstellm&ouml;glichkeiten sind thematisch gruppiert.
  Jede einzelne Gruppe finden Sie auf einer separaten Unterseite
  innerhalb der Unterseite f&uuml;r die Einstellungen.
 <br/><br/>

 <h3>1.1. System</h3>
  Den JU+TE-Computer gibt es in mehreren Ausbaustufen,
  die sich sowhl von der Gr&ouml;&szlig;e des Betriebssystems
  als auch von der Hardware unterscheiden.
  Mit den Einstellungen in der Gruppe <em>System</em> w&auml;hlen
  sie die gew&uuml;nschte Ausbaustufe aus.
 <br/><br/>

 <h3>1.1.1. Register %80 bis %EF emulieren</h3>
  Der Einchipmikrorechner U883 enth&auml;lt 124 Universalregister
  (Register %04 bis %7F).
  Einige, insbesondere neuere Z8-Mikrocontroller beherbergen dagegen
  sogar 236 Universalregister, d.h. auch die Register %80 bis %EF.
  Mit der Option geben Sie an,
  ob auch diese zus&auml;tzlichen Register emuliert werden sollen.
 <br/><br/>

 <h3>1.2. RAM</h3>
  Hier legen Sie den RAM-Bereich fest
  (siehe <a href="../common/jtc.htm#memory">Speicheraufteilung</a>).
 <br/><br/>
  <b>Achtung!</b> Bei <em>1&nbsp;KByte RAM</em> und <em>2&nbsp;KByte RAM</em>
  wird wie beim Original die unvollst&auml;ndige Adressdekodierung emuliert,
  d.h., der 1-KByte-Speicher ist ab Adresse %E000 8&nbsp;mal beziehungsweise
  der 2-KByte-Speicher 4 mal hintereinander eingeblendet.
 <br/><br/>

 <h3>1.3. ROM</h3>
  Mit der Auswahl des Betriebssystems in den Einstellungen bei
  <em>System</em> sind auch die ROM-Bereiche vorgegeben.
  Zus&auml;tzlich k&ouml;nnen Sie diese ROM-Bereiche
  &uuml;berschreiben bzw. neue ROM-Bereiche anlegen,
  indem Sie externe ROM-Images einbinden.
  Diese ROM-Images m&uuml;ssen als
  <a href="../common/loadsave.htm#binary">Bin&auml;rdateien</a> vorliegen.
 <br/><br/>
  Ein ROM-Image binden Sie ein, indem Sie auf den Knopf
  <em>Hinzuf&uuml;gen</em> dr&uuml;cken.
  In dem sich nun &ouml;ffnenden Dateiauswahldialog selektieren Sie
  die einzubindende Bin&auml;rdatei.
  Anschlie&szlig;end werden Sie nach der Anfangsadresse gefragt,
  an der das ROM-Image im Arbeitsspeicher zu finden sein soll.
  Die L&auml;nge des so angelegten ROM-Bereichs ergibt sich aus der
  L&auml;nge der eingebundenen Datei.
 <br/><br/>
  ROM-Images k&ouml;nnen an jeder beliebigen Adresse eingebunden werden,
  egal ob das sinnvoll ist oder nicht.
  Sie k&ouml;nnen somit auch den Bildwiederholspeicher
  oder den Stack-Bereich als ROM deklarieren,
  was h&ouml;chstwahrscheinlich nicht sinnvoll ist.
  Wenn Sie ein ROM-Image auf Adresse %0000 einbinden,
  wird damit der BASIC-Interpreter des U883 &uuml;berschrieben,
  was bei einem echten JU+TE-Computer nicht m&ouml;glich ist.
 <br/><br/>
  Als weitere Option k&ouml;nnen Sie festlegen,
  ob die ROM-Dateien bei jedem simulierten <em>Einschalten</em>
  neu geladen werden sollen.
  Im Normalfall hat das wenig Sinn.
  Doch wenn Sie ein Betriebssystem f&uuml;r den JU+TE-Computer entwickeln
  und den Emulator zum Testen verwenden,
  ist diese Option sehr hilfreich.
  Nachdem Sie mit Ihren Entwicklungswerkzeugen ein neues ROM-Image
  erzeugt haben, brauchen Sie im Emulator nur das
  <em>Einschalten (Speicher l&ouml;schen)</em> ausl&ouml;sen,
  und schon ist die neue Betriebssystemversion aktiv.
 <br/><br/>

 <h3>1.4. Best&auml;tigungen</h3>
  Hier geben Sie an, welche Aktionen erst nach der Bejahung einer
  Sicherheitsabfrage ausgef&uuml;hrt werden sollen.
 <br/><br/>

 <h3>1.5 Sonstiges</h3>
  In dieser Gruppe finden Sie die Einstellungen,
  die sich in keine andere Gruppe sinnvoll einordnen lassen.
 <br/><br/>

 <h3>1.5.1. Rand um Bildschirmausgabe</h3>
  Sie k&ouml;nnen einen schwarzen Rand um die Bildschrirmausgabe erzeugen,
  indem Sie das Hauptfenster gr&ouml;&szlig;er ziehen.
  Sobald das Fenster so gro&szlig; ist,
  dass die n&auml;chste Skalierungstufe hineinpasst,
  wird die Bildschirmausgabe neu skaliert.
  Dabei wird der eingestellte Rand ber&uuml;cksichtigt.
  Er hat in dem Fall die Bedeutung eines minimalen Randes.
 <br/><br/>
  Wenn Sie jedoch die Einstellungen speichern (siehe weiter unten)
  und JTCemuFX neu starten, dann kommt auch der eingestellte Rand
  zur Geltung.
 <br/><br/>

 <h3>1.5.2. Aktualisierungszyklus der Bildschirmausgabe</h3>
  Der Emulator aktualisiert zyklisch die Bildschirmausgabe
  entsprechend den &Auml;nderungen im Bildwiederholspeicher
  bzw. im Video-RAM.
  Eine k&uuml;rzere Zykluszeit bewirkt eine fl&uuml;ssigere
  Bildschirmausgabe.
  Allerdings steigt damit auch der Bedarf an Rechenleistung.
  Eine zu kurze Zykluszeit kann die Bedienung des Emulators
  beeintr&auml;chtigen, da dann evtl. zu wenig Rechenleistung f&uuml;r
  das Reagieren auf die Benutzeraktionen zur Verf&uuml;gung steht.
 <br/><br/>
  Der Standardwert von 50 ms, d.h. 20 mal pro Sekunde,
  ist in der Regel auf den heute &uuml;blichen Arbeitsplatzrechnern
  ein guter Kompromiss zwischen fl&uuml;ssiger Bildschirmausgabe und
  fl&uuml;ssiger Bedienung.
 <br/><br/>

 <h3>1.5.3. Zuletzt verwendete Dateipfade werden gespeichert in Datei</h3>
  Die hier angegebene Datei ist das Ged&auml;chtnis des Emulators
  f&uuml;r die zuletzt verwendeten Dateipfade.
  Damit wird erm&ouml;glicht, dass beim &Ouml;ffnen, Laden oder Speichern
  einer Datei der Dateiauswahldialog gleich mit dem Verzeichnis &ouml;ffnet,
  welches zuletzt f&uuml;r die betreffende Dateikategorie verwendet wurde.
 <br/><br/>
  Sie k&ouml;nnen diese Ged&auml;chtnisdatei beliebig l&ouml;schen
  (sofern sie bereits exisitiert).
  Dann &ouml;ffnet beim n&auml;chsten mal der Dateiauswahldialog
  in einem Standardverzeichnis.
  Beim n&auml;chsten erfolgreichen &Ouml;ffnen, Laden oder Speichern
  einer Datei wird diese Ged&auml;chtnisdatei automatisch wieder angelegt.
 <br/><br/>

 <h3>1.5.4. Einstellungen werden gespeichert in Datei</h3>
  Hier sehen Sie den vollst&auml;ndigen Namen der Datei,
  in dem die Einstellungen gespeichert werden (siehe weiter unten).
 <br/><br/>
  Sie haben die M&ouml;glichkeit,
  diese Datei zu l&ouml;schen, sofern sie bereits existiert.
  Damit k&ouml;nnen Sie auf die Standardeinstellungen zur&uuml;cksetzen.
  Starten Sie dazu nach dem L&ouml;schen der Datei den Emulator einfach neu.
 <br/><br/>

 <h2>2. Einstellungen &uuml;bernehmen und speichern</h2>
  Nachdem Sie eine Einstellung ge&auml;ndert haben,
  wird der Knopf <em>&Uuml;bernehmen</em> aktiv,
  und sie k&ouml;nnen damit die neuen Einstellungen aktivieren.
 <br/><br/>
  Nach dem Aktivieren der neuen Einstellungen wird der Knopf
  <em>Speichern</em> aktiv.
  Damit haben Sie die M&ouml;glichkeit,
  die Einstellungen dauerhaft zu speichern,
  damit sie beim n&auml;chsten Start des Emulators
  wieder so gesetzt werden.
 <br/><br/>
  Beim Speichern der Einstellungen wird auch die Position
  des JTCemuFX-Fensters gespeichert.
</body>
</html>
